protogia/avr-descriptionfiles-4-nim/svd/AT90CAN64.atdf.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FUSE</name>
      <description>Fuses</description>
      <baseAddress>0x00000000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>EXTENDED</name>
          <description>No Description.</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TA0SEL</name>
              <description>Reserved for factory tests</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BODLEVEL</name>
              <description>Brown-out Detector trigger level</description>
              <bitRange>[3:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2V5</name>
                  <description>Brown-out detection level at VCC=2.5 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2V6</name>
                  <description>Brown-out detection level at VCC=2.6 V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2V7</name>
                  <description>Brown-out detection level at VCC=2.7 V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3V8</name>
                  <description>Brown-out detection level at VCC=3.8 V</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3V9</name>
                  <description>Brown-out detection level at VCC=3.9 V</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V0</name>
                  <description>Brown-out detection level at VCC=4.0 V</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V1</name>
                  <description>Brown-out detection level at VCC=4.1 V</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Brown-out detection disabled</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HIGH</name>
          <description>No Description.</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BOOTRST</name>
              <description>Boot Reset vector Enabled</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BOOTSZ</name>
              <description>Select Boot Size</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>4096W_7000</name>
                  <description>Boot Flash size=4096 words start address=$7000</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2048W_7800</name>
                  <description>Boot Flash size=2048 words start address=$7800</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1024W_7C00</name>
                  <description>Boot Flash size=1024 words start address=$7C00</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512W_7E00</name>
                  <description>Boot Flash size=512 words start address=$7E00</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EESAVE</name>
              <description>Preserve EEPROM through the Chip Erase cycle</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WDTON</name>
              <description>Watchdog timer always on</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPIEN</name>
              <description>Serial program downloading (SPI) enabled</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>JTAGEN</name>
              <description>JTAG Interface Enabled</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OCDEN</name>
              <description>On-Chip Debug Enabled</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOW</name>
          <description>No Description.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SUT_CKSEL</name>
              <description>Select Clock Source</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXTCLK_6CK_0MS</name>
                  <description>Ext. Clock; Start-up time: 6 CK + 0 ms</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTRCOSC_6CK_0MS</name>
                  <description>Int. RC Osc.; Start-up time: 6 CK + 0 ms</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTLOFXTAL_1KCK_0MS</name>
                  <description>Ext. Low-Freq. Crystal; Start-up time: 1K CK + 0 ms</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTLOFXTAL_32KCK_0MS</name>
                  <description>Ext. Low-Freq. Crystal; Start-up time: 32K CK + 0 ms</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTLOFXTAL_1KCK_0MS_INTCAP</name>
                  <description>Ext. Low-Freq. Crystal; Start-up time: 1K CK + 0 ms; Int. Cap.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTLOFXTAL_32KCK_0MS_INTCAP</name>
                  <description>Ext. Low-Freq. Crystal; Start-up time: 32K CK + 0 ms; Int. Cap.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ4_0MHZ9_258CK_4MS1</name>
                  <description>Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time: 258 CK + 4.1 ms</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ4_0MHZ9_1KCK_65MS</name>
                  <description>Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time: 1K CK + 65 ms</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ9_3MHZ_258CK_4MS1</name>
                  <description>Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time: 258 CK + 4.1 ms</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ9_3MHZ_1KCK_65MS</name>
                  <description>Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time: 1K CK + 65 ms</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_3MHZ_8MHZ_258CK_4MS1</name>
                  <description>Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time: 258 CK + 4.1 ms</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_3MHZ_8MHZ_1KCK_65MS</name>
                  <description>Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time: 1K CK + 65 ms</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_8MHZ_16MHZ_258CK_4MS1</name>
                  <description>Ext. Crystal Osc. 8.0-16.0 MHz; Start-up time: 258 CK + 4.1 ms</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_8MHZ_16MHZ_1KCK_65MS</name>
                  <description>Ext. Crystal Osc. 8.0-16.0 MHz; Start-up time: 1K CK + 65 ms</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTCLK_6CK_4MS1</name>
                  <description>Ext. Clock; Start-up time: 6 CK + 4.1 ms</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTRCOSC_6CK_4MS1</name>
                  <description>Int. RC Osc.; Start-up time: 6 CK + 4.1 ms</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTLOFXTAL_1KCK_4MS1</name>
                  <description>Ext. Low-Freq. Crystal; Start-up time: 1K CK + 4.1 ms</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTLOFXTAL_32KCK_4MS1</name>
                  <description>Ext. Low-Freq. Crystal; Start-up time: 32K CK + 4.1 ms</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTLOFXTAL_1KCK_4MS1_INTCAP</name>
                  <description>Ext. Low-Freq. Crystal; Start-up time: 1K CK + 4.1 ms; Int. Cap.</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTLOFXTAL_32KCK_4MS1_INTCAP</name>
                  <description>Ext. Low-Freq. Crystal; Start-up time: 32K CK + 4.1 ms; Int. Cap.</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ4_0MHZ9_258CK_65MS</name>
                  <description>Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time: 258 CK + 65 ms</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ9_3MHZ_258CK_65MS</name>
                  <description>Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time: 258 CK + 65 ms</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_3MHZ_8MHZ_258CK_65MS</name>
                  <description>Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time: 258 CK + 65 ms</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_8MHZ_16MHZ_258CK_65MS</name>
                  <description>Ext. Crystal Osc. 8.0-16.0 MHz; Start-up time: 258 CK + 65 ms</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTCLK_6CK_65MS</name>
                  <description>Ext. Clock; Start-up time: 6 CK + 65 ms</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTRCOSC_6CK_65MS</name>
                  <description>Int. RC Osc.; Start-up time: 6 CK + 65 ms</description>
                  <value>34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTLOFXTAL_1KCK_65MS</name>
                  <description>Ext. Low-Freq. Crystal; Start-up time: 1K CK + 65 ms</description>
                  <value>36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTLOFXTAL_32KCK_65MS</name>
                  <description>Ext. Low-Freq. Crystal; Start-up time: 32K CK + 65 ms</description>
                  <value>37</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTLOFXTAL_1KCK_65MS_INTCAP</name>
                  <description>Ext. Low-Freq. Crystal; Start-up time: 1K CK + 65 ms; Int. Cap.</description>
                  <value>38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTLOFXTAL_32KCK_65MS_INTCAP</name>
                  <description>Ext. Low-Freq. Crystal; Start-up time: 32K CK + 65 ms; Int. Cap.</description>
                  <value>39</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ4_0MHZ9_1KCK_0MS</name>
                  <description>Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time: 1K CK + 0 ms</description>
                  <value>40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ9_3MHZ_1KCK_0MS</name>
                  <description>Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time: 1K CK + 0 ms</description>
                  <value>42</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_3MHZ_8MHZ_1KCK_0MS</name>
                  <description>Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time: 1K CK + 0 ms</description>
                  <value>44</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_8MHZ_16MHZ_1KCK_0MS</name>
                  <description>Ext. Crystal Osc. 8.0-16.0 MHz; Start-up time: 1K CK + 0 ms</description>
                  <value>46</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ4_0MHZ9_1KCK_4MS1</name>
                  <description>Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time: 1K CK + 4.1 ms</description>
                  <value>56</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ9_3MHZ_1KCK_4MS1</name>
                  <description>Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time: 1K CK + 4.1 ms</description>
                  <value>58</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_3MHZ_8MHZ_1KCK_4MS1</name>
                  <description>Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time: 1K CK + 4.1 ms</description>
                  <value>60</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_8MHZ_16MHZ_1KCK_4MS1</name>
                  <description>Ext. Crystal Osc. 8.0-16.0 MHz; Start-up time: 1K CK + 4.1 ms</description>
                  <value>62</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CKOUT</name>
              <description>Clock output on PORTC7; [CKOUT=0]</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CKDIV8</name>
              <description>Divide clock by 8 internally; [CKDIV8=0]</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
